app/controllers/items_controller.rb

  def index
    render :json => Item.all
---
SELECT "items".* FROM "items"

  def show
    render :json => Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]